import { useState } from "react";

interface TermRepository {
    name: string
}

const TermPartner = ({name} :TermRepository) => {
    const [termStatus,setTermStatus] = useState<boolean>(true)
    const onClickAccept = () => {
        setTermStatus(false)
    }

    const onClickAcceptOption = () => {
        const myCheck = document.getElementById(name)
        myCheck?.click()
    }
    return (
        termStatus && <div className="fixed top-0 left-0 z-50 w-full h-screen bg-black/40 flex justify-center py-4">
            <div className="panel w-[50%] text-base flex flex-col gap-4 overflow-scroll px-8">
                <div className="flex flex-col items-center">
                    <h3 className="font-bold text-lg">ข้อตกลงและเงื่อนไขการร่วมเป็นร้านค้าพาร์ทเนอร์</h3>
                    <h5 className="font-semibold">Terms & Conditions for Authorized Partner Stores </h5>
                </div>
                <p>
                    1. การยอมรับเงื่อนไข การสมัครเข้าร่วมเป็น “ร้านค้าพาร์ทเนอร์ (Authorized Partner)” ภายใต้โครงการ Panda Partner ถือว่าท่าน (“ร้านค้าพาร์ทเนอร์”) ได้อ่าน ทำความเข้าใจ
                    และยอมรับข้อกำหนดทั้งหมดในเอกสารนี้อย่างสมบูรณ์โดยการคลิก “ยอมรับและสมัครเป็นพาร์ทเนอร์” มีผลผูกพันตามกฎหมายเช่นเดียวกับการลงนามในสัญญาตาม พ.ร.บ.ธุรกรรมทางอิเล็กทรอนิกส์พ.ศ. 2544
                    มาตรา 13
                </p>
                <p>
                    2. สถานะทางกฎหมายและความสัมพันธ์กับบริษัท 1. ร้านค้าพาร์ทเนอร์เป็นผู้ประกอบการอิสระ (Independent Business Partner) ไม่ถือว่าเป็นตัวแทนทางกฎหมาย (Agent) หรือพนักงานของบริษัท แพนด้า
                    สตูดิโอ จำกัด (“บริษัท”) 2. บริษัทไม่มีพันธะในการรับผิดชอบต่อการกระทำของร้านค้าพาร์ทเนอร์ เว้นแต่ระบุไว้โดยชัดแจ้ง 3. ร้านค้าพาร์ทเนอร์ไม่มีสิทธิ์ผูกพัน หรือตกลงใด ๆ
                    ในนามของบริษัทโดยไม่ได้รับอนุญาตเป็นลายลักษณ์อักษร 4. ข้อตกลงนี้ไม่ก่อให้เกิดความสัมพันธ์ในลักษณะ ตัวแทน (Agency), นายจ้าง– ลูกจ้าง (Employment), หรือหุ้นส่วน (Partnership){' '}
                </p>
                <p>
                    3. การเข้าร่วมและคุณสมบัติ เพื่อเข้าร่วมเป็นร้านค้าพาร์ทเนอร์ท่านต้องมีคุณสมบัติดังนี้: • เป็นบุคคลธรรมดาหรือนิติบุคคลที่มีเลขประจำตัวผู้เสียภาษีถูกต้อง • ไม่มีประวัติการฉ้อโกง
                    หรือถูกเพิกถอนสิทธิจากโครงการในอดีต • ยินยอมให้บริษัทตรวจสอบข้อมูลพื้นฐานเพื่อวัตถุประสงค์ด้านความปลอดภัย ทางธุรกิจ • มีสถานที่ประกอบการจริงหรือช่องทางออนไลน์ที่สามารถติดต่อได้ •
                    ยินยอมให้บริษัทใช้ชื่อ/โลโก้ร้านค้าเพื่อแสดงบนเว็บไซต์ในฐานะพาร์ทเนอร์{' '}
                </p>
                <p>
                    4. สิทธิและหน้าที่ของร้านค้าพาร์ทเนอร์ 1. ร้านค้าพาร์ทเนอร์มีสิทธิ์: o เข้าถึงระบบ Partner Portal ของบริษัทเพื่อดูสินค้าและรายการขาย o แนะนำลูกค้าเข้าสู่ระบบผ่อนสินค้า เช่าซื้อ
                    หรือบริการทางการเงินที่บริษัทกำหนด o รับค่าคอมมิชชั่นหรือค่าตอบแทนตามที่บริษัทประกาศ 2. ร้านค้าพาร์ทเนอร์ต้อง: o ปฏิบัติตามนโยบายและมาตรฐานที่บริษัทกำหนดทุกประการ o
                    ใช้ระบบของบริษัทในการส่งต่อข้อมูลลูกค้าเท่านั้น o ห้ามเก็บข้อมูลลูกค้าไว้ใช้เองหรือโอนให้บุคคลที่สาม o ห้ามเรียกเก็บเงิน มัดจำ หรือค่าธรรมเนียมจากลูกค้าโดยตรง{' '}
                </p>
                <p>
                    5. ค่าตอบแทนและภาษี 1. บริษัทจะจ่ายค่าตอบแทนให้ร้านค้าพาร์ทเนอร์ตามโครงสร้างที่ประกาศในระบ บ Partner Portal 2. การจ่ายค่าตอบแทนจะดำเนินการภายใน 3
                    วันทำการของรอบที่รายการขายได้รับอนุมัติ 3. บริษัทจะหักภาษีณ ที่จ่ายตามอัตราที่กฎหมายกำหนด 4. การจ่ายค่าตอบแทนนี้ถือเป็น รายได้จากการให้บริการ (Service Income)
                    มิใช่เงินปันผลหรือส่วนแบ่งกำไร 5. ร้านค้าต้องจัดทำใบกำกับภาษี/ใบรับเงิน เพื่อประกอบการจ่ายเงิน 6. บริษัทมีสิทธิระงับการจ่ายค่าตอบแทนชั่วคราว หากพบข้อพิรุธหรือการละเมิดนโยบาย
                    บริษัทฯ จะจ่ายค่าคอมมิชชั่นให้แก่ร้านค้าพาร์ทเนอร์ตามอัตราที่ระบุไว้ในภาคผนวก ก (Appendix A) ซึ่งบริษัทฯ อาจปรับปรุงได้เป็นครั้งคราว โดยแจ้งให้ร้านค้าทราบล่วงหน้าไม่น้อยกว่า 7 วัน
                    ผ่านช่องทางอิเล็กทรอนิกส์ที่บริษัทฯ กำหนด การแก้ไขดังกล่าวให้ถือว่ามีผลผูกพันตามสัญญานี้เมื่อถึงวันที่มีผลบังคับใช้ที่บริษัท ฯ แจ้งไว้{' '}
                </p>
                <p>
                    6. การใช้ชื่อ โลโก้และสื่อทางการตลาด • ร้านค้าพาร์ทเนอร์สามารถใช้โลโก้หรือชื่อ “Panda Studio” เพื่อส่งเสริมการขายได้ เฉพาะในรูปแบบที่บริษัทอนุญาตเป็นลายลักษณ์อักษรเท่านั้น •
                    ห้ามแก้ไข ดัดแปลง หรือใช้โลโก้ในทางที่อาจทำให้เกิดความเข้าใจผิด • บริษัทมีสิทธิเพิกถอนสิทธิการใช้โลโก้เมื่อใดก็ได้
                    ร้านค้าพาร์ทเนอร์ได้รับสิทธิ์ในการใช้ชื่อและโลโก้ของบริษัทเพื่อวัตถุประสงค์ทาง การตลาดและประชาสัมพันธ์ภายใต้ข้อกำหนดตามภาคผนวก ข (Appendix B) เท่านั้น บริษัทฯ
                    สงวนสิทธิ์ในการเพิกถอนสิทธิ์ดังกล่าวได้ทุกเมื่อ หากมีการใช้งานผิดวัตถุประสงค์หรือสร้างความเสียหายต่อชื่อเสียงของบริษัทฯ{' '}
                </p>
                <p>
                    7. การคุ้มครองข้อมูลส่วนบุคคล (PDPA) 1. บริษัทเป็น ผู้ควบคุมข้อมูลส่วนบุคคล (Data Controller) ส่วนร้านค้าพาร์ทเนอร์เป็น ผู้ประมวลผลข้อมูล (Data Processor) 2.
                    ร้านค้าต้องใช้ข้อมูลลูกค้าเฉพาะเพื่อวัตถุประสงค์ที่ได้รับอนุญาตเท่านั้น 3. ห้ามโอนข้อมูลลูกค้าไปยังบุคคลที่สามโดยไม่ได้รับความยินยอม 4. ในกรณีละเมิดข้อมูลส่วนบุคคล
                    ร้านค้าพาร์ทเนอร์ต้องแจ้งบริษัทภายใน 24 ชั่วโมง ร้านค้าพาร์ทเนอร์ตกลงปฏิบัติตามนโยบายคุ้มครองข้อมูลส่วนบุคคลของบริษัท ตามที่ระบุไว้ในภาคผนวก ค (Appendix C)
                    ซึ่งถือเป็นส่วนหนึ่งของสัญญาฉบับนี้ และให้ถือว่าร้านค้าพาร์ทเนอร์เป็นผู้ประมวลผลข้อมูลส่วนบุคคล (Processor) ภายใต้คำสั่งของบริษัทซึ่งเป็นผู้ควบคุมข้อมูลส่วนบุคคล (Controller){' '}
                </p>
                <p>
                    8. การตรวจสอบและควบคุมคุณภาพ • บริษัทมีสิทธิ์ตรวจสอบกิจกรรมของร้านค้าพาร์ทเนอร์เพื่อให้เป็นไปตามมาตร ฐาน • หากพบพฤติกรรมที่ไม่เหมาะสม เช่น เรียกเก็บเงินจากลูกค้าเอง
                    หรือส่งข้อมูลเท็จ บริษัทสามารถระงับบัญชีพาร์ทเนอร์ทันทีโดยไม่ต้องแจ้งล่วงหน้า{' '}
                </p>
                <p>
                    9. การบอกเลิกความร่วมมือ 1. ทั้งสองฝ่ายสามารถยกเลิกความร่วมมือโดยแจ้งล่วงหน้าไม่น้อยกว่า 15 วัน 2. หากร้านค้าฝ่าฝืนข้อตกลง บริษัทมีสิทธิบอกเลิกทันทีโดยไม่ต้องแจ้งล่วงหน้า 3.
                    เมื่อสิ้นสุดการเป็นพาร์ทเนอร์ร้านค้าต้องหยุดใช้โลโก้เอกสาร และข้อมูลทั้งหมดของบริษัท{' '}
                </p>
                <p>
                    10. การแก้ไขข้อตกลง บริษัทมีสิทธิ์แก้ไขหรือปรับปรุงเงื่อนไขเหล่านี้ได้ทุกเวลา โดยประกาศผ่านเว็บไซต์หรือระบบ Shop Portal การใช้งานระบบหลังจากประกาศ
                    ถือว่าท่านยอมรับเงื่อนไขใหม่โดยปริยาย{' '}
                </p>
                <p>
                    11. ข้อจำกัดความรับผิด บริษัทไม่รับผิดชอบต่อความเสียหายทางตรงหรือทางอ้อมที่เกิดจาก • การใช้งานระบบโดยมิชอบ • ความผิดพลาดจากร้านค้าหรือพนักงานของร้านค้า •
                    การสื่อสารกับลูกค้าโดยไม่เป็นไปตามนโยบายบริษัท{' '}
                </p>
                <p>12. กฎหมายที่ใช้บังคับและเขตอำนาจศาล • ข้อตกลงนี้อยู่ภายใต้กฎหมายไทย • ให้ศาลจังหวัดสมุทรปราการเป็นศาลที่มีอำนาจพิจารณาข้อพิพาท </p>
                <div>
                    <p className="font-semibold">การยอมรับเงื่อนไข</p>
                    <p>โดยการคลิก “ยอมรับและสมัครเป็นพาร์ทเนอร์” ท่านรับรองว่าได้อ่าน ทำความเข้าใจ และตกลงผูกพันตามข้อกำหนดทั้งหมดนี้แล้ว</p>
                    <div className="flex gap-4 mb-3 cursor-pointer" onClick={onClickAcceptOption}>
                        <input type="radio" name="accept" id={name} />
                        <p>ยอมรับและสมัครเป็นพาร์เนอร์</p>
                    </div>
                    <button onClick={onClickAccept} className="btn btn-primary w-full">ยอมรับ</button>
                </div>
            </div>
        </div>
    );
};

export default TermPartner;
